#!/bin/bash
tmp1=`mktemp`
tmp2=`mktemp`

fileread () {
cat $1 \
| sed -r \
-e ':loop;N;$!b loop;s|\n| |g' \
-e 's|(<span)([a-z]*)|\1 \2|g' \
-e 's|(<[a-z]*) [^>]*>|\1>|g' \
-e 's| +| |g' \
-e 's|[ ]*(\[)[ ]*|\1|g' \
-e 's|[ ]*(\])[ ]*|\1|g' \
-e 's|<span>\[</span>|\[|g' \
-e 's|<span>\]</span>|\]|g' \
-e 's|\[<span>|\[|g' \
-e 's|\]</span>|\]|g' \
-e 's|<span>\[|\[|g' \
-e 's|</span>\]|\]|g' \
-e 's|<p>|\n<p>|g' \
-e 's|<i></span>|<i>|g' \
-e 's|<span></i>|</i>|g' \
-e 's|<i><span>|<i>|g' \
-e 's|</span></i>|</i>|g' \
-e 's|<i>|\$\{|g' \
-e 's|</i>|\}|g' \
-e 's|</span>(\$\{)|\1|g' \
-e 's|(\})<span>|\1|g' \
-e 's|<span>([ ]*[A-Z,a-z,0-9,/, ,\(,\)]*[ ]*)</span>|\1|g' \
-e 's|[\.]+[\.]+|\.\.\.\.\.\.\.|g' \
-e 's|</span><span>||g' \
-e 's|<p>\[</p>|\[|g' \
-e 's|<p>\]</p>|\]|g' \
-e 's|\]<b>|\]</p>\n<p><b>|g' \
| sed -r \
-e ':loop;N;$!b loop;s|\n| |g' \
-e 's| +| |g' \
-e 's|\[ <p>|\[|g' \
-e 's|</p> \]|\]|g' \
-e 's|</p> <p>\$|\$|g' \
-e 's|<p>|\n<p>|g' \
-e 's|</p> (\[[-,\$,\{,\},a-z,_}]*\])|\1</p>|g' \
| grep  -v -e "初期値" -e "設定" -e "説明" -e "適用" -e "<span>" -e "<p><b>[0-9,A-Z][0-9]*" -e "\.\.\.\.\." \
| grep "<p><b>[a-z]*" \
| sed \
-e 's|<[/,a-z]*>||g' \
-e 's|[ ]*\(\[\)[ ]*| \1|g' \
-e 's|[ ]*\(\]\)[ ]*|\1 |g' \
-e 's|[ ]*\(${\)[ ]*| \1|g' \
-e 's|[ ]*\(}\)[ ]*|\1 |g' \
-e 's|\(\[\)[ ]*\(\$\)|\1\2|g' \
-e 's|\(}\)[ ]*\(\]\)|\1\2|g'
}

fileread $1

rm ${tmp1} ${tmp2}

